public class Main {
    public static void main(String[] args) {System.out.println("Домашняя работа УСЛОВНЫЕ ОПЕРАТОРЫ");
        System.out.println("Задание 1");
        //Задание 1
        //С помощью условного оператора напишите программу, которая выводит в консоль:
        //поздравление пользователя с совершеннолетием, если ему равно или больше 18 лет;
        //информационное сообщение, что возраст совершеннолетия ещё не наступил, и нужно немного подождать.
        int age = 19;
        if (age >= 18)
            System.out.println("Поздравляю с совершеннолетием! ");
        else
            System.out.println("Возраст совершеннолетия ещё не наступил, и нужно еще немного подождать");
        System.out.println("");

        System.out.println("Задание 1");
        //Задание 2
        //Напишите программу, которая выводит в консоль сообщение о том, что:
        //ребенок ходит в школу, если его возраст равен или больше 7 годам
        //человек уже закончил школу и может отправляться в университет, если его возраст 18 и больше;
        //человек окончил университет и ему пора искать первую работу, если ему 24 и больше лет.

    }
}